yoisho-assets/app/assets_request.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:yois="yoisho.total.assets">
   <soapenv:Header/>
   <soapenv:Body>
      <yois:bank_assets/>
   </soapenv:Body>
</soapenv:Envelope>
